In [1]:
# Import necessary module
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [3]:
table_names = engine.table_names()

C:\Users\mlanj\AppData\Local\Temp/ipykernel_8324/2273142574.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  table_names = engine.table_names()

In [4]:
print(table_names)

['Bookings', 'Facilities', 'Members']

In [10]:
with engine.connect() as con:
    rs10 = con.execute("SELECT name, SUM(Cost) as revenue " +
                     "FROM(SELECT name,CASE WHEN b.memid = 0 THEN slots * guestcost " +
                     "ELSE slots * membercost END AS Cost " +
                     "FROM Bookings as b INNER JOIN `Facilities` as f ON  b.facid =  f.facid ORDER BY Cost DESC) as cost " +
                     "GROUP BY name;")
    df10 = pd.DataFrame(rs10.fetchall())
    df10.columns = rs10.keys()

In [7]:
print(len(df))

9

In [8]:
print(df[df.revenue<1000])

            name  revenue
3     Pool Table    270.0
4  Snooker Table    240.0
6   Table Tennis    180.0

In [18]:
with engine.connect() as con:
    rs11 = con.execute("SELECT ( m1.firstname || ' ' || m1.surname) AS MemberName, " +
                     "( m2.firstname || ' ' || m2.surname) AS Recomendedby " +
                     "FROM Members m1 " +
                     "INNER JOIN Members m2 " +
                     "ON m1.memid = m2.recommendedby " +
                     "ORDER BY MemberName;")
    df11 = pd.DataFrame(rs11.fetchall())
    df11.columns = rs11.keys()

In [19]:
print(df11)

           MemberName             Recomendedby
0        Burton Tracy          Ponder Stibbons
1        Darren Smith          Janice Joplette
2        Darren Smith           Gerald Butters
3        Darren Smith             Charles Owen
4        Darren Smith               Jack Smith
5        Darren Smith           Anna Mackenzie
6         David Jones            Douglas Jones
7      Florence Bader         Ramnaresh Sarwin
8      Gerald Butters          Matthew Genting
9     Janice Joplette               Nancy Dare
10    Janice Joplette              David Jones
11     Jemima Farrell            Timothy Baker
12     Jemima Farrell             David Pinker
13    Matthew Genting         Henrietta Rumney
14  Millicent Purview                John Hunt
15    Ponder Stibbons               Anne Baker
16    Ponder Stibbons           Florence Bader
17         Tim Rownam               Tim Boothe
18      Timothy Baker              Joan Coplin
19        Tracy Smith  Henry Worthington-Smyth
20        Tracy Smith        Millicent Purview
21        Tracy Smith            Erica Crumpet

In [27]:
with engine.connect() as con:
    rs12 = con.execute("SELECT DISTINCT name, firstname, surname FROM `Bookings` b " +
                     "INNER JOIN `Facilities` as f ON  b.facid =  f.facid " +
                     "INNER JOIN `Members` as m ON m.memid = b.memid " +
                     "WHERE b.memid > 0 " +
                     "ORDER BY b.memid ")
    df12 = pd.DataFrame(rs12.fetchall())
    df12.columns = rs12.keys()

In [28]:
df12

                name firstname  surname
0       Table Tennis    Darren    Smith
1     Massage Room 1    Darren    Smith
2      Snooker Table    Darren    Smith
3         Pool Table    Darren    Smith
4       Squash Court    Darren    Smith
..               ...       ...      ...
197     Squash Court      John     Hunt
198  Badminton Court     Erica  Crumpet
199   Massage Room 1     Erica  Crumpet
200   Tennis Court 1     Erica  Crumpet
201     Table Tennis     Erica  Crumpet

[202 rows x 3 columns]

In [37]:
with engine.connect() as con:
    rs13 = con.execute("SELECT DISTINCT name, SUBSTR(starttime,6,2) as month FROM `Bookings` b " +
                     "INNER JOIN `Facilities` as f ON  b.facid =  f.facid " +
                     "INNER JOIN `Members` as m ON m.memid = b.memid " +
                     "WHERE b.memid > 0 " +
                     "ORDER BY month ")
    df13 = pd.DataFrame(rs13.fetchall())
    df13.columns = rs13.keys()

In [38]:
df13

               name month
0      Table Tennis    07
1    Massage Room 1    07
2     Snooker Table    07
3        Pool Table    07
4    Tennis Court 1    07
5      Squash Court    07
6   Badminton Court    07
7    Tennis Court 2    07
8    Massage Room 2    07
9    Tennis Court 1    08
10   Tennis Court 2    08
11  Badminton Court    08
12     Table Tennis    08
13   Massage Room 1    08
14   Massage Room 2    08
15     Squash Court    08
16    Snooker Table    08
17       Pool Table    08
18   Tennis Court 1    09
19   Tennis Court 2    09
20  Badminton Court    09
21     Table Tennis    09
22   Massage Room 1    09
23   Massage Room 2    09
24     Squash Court    09
25    Snooker Table    09
26       Pool Table    09